eval_scripts/todo/vm_clone_experiment/write_performance_on_cloned_vm_images/fio_output/fioOut_8GB_randWrite_coldCache_4096bs_Ext4_1thread_asynchOff_ext4
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=1341: Thu May 22 16:00:27 2025
  write: IOPS=4166, BW=16.3MiB/s (17.1MB/s)(8192MiB/503362msec)
    clat (usec): min=164, max=215756, avg=236.70, stdev=740.79
     lat (usec): min=165, max=215757, avg=237.00, stdev=740.80
    clat percentiles (usec):
     |  1.00th=[  172],  5.00th=[  174], 10.00th=[  174], 20.00th=[  176],
     | 30.00th=[  178], 40.00th=[  184], 50.00th=[  192], 60.00th=[  196],
     | 70.00th=[  200], 80.00th=[  215], 90.00th=[  258], 95.00th=[  334],
     | 99.00th=[ 1090], 99.50th=[ 2540], 99.90th=[ 4490], 99.95th=[ 5669],
     | 99.99th=[11076]
   bw (  KiB/s): min= 2264, max=21729, per=100.00%, avg=16703.65, stdev=4268.27, samples=1006
   iops        : min=  566, max= 5432, avg=4175.67, stdev=1067.02, samples=1006
  lat (usec)   : 250=89.35%, 500=8.75%, 750=0.63%, 1000=0.23%
  lat (msec)   : 2=0.36%, 4=0.54%, 10=0.13%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.83%, sys=52.65%, ctx=2098884, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=16.3MiB/s (17.1MB/s), 16.3MiB/s-16.3MiB/s (17.1MB/s-17.1MB/s), io=8192MiB (8590MB), run=503362-503362msec

Disk stats (read/write):
  sda: ios=9116/2107820, merge=6055/27844, ticks=3521/437677, in_queue=23236, util=98.98%
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=1311: Thu May 22 16:11:57 2025
  write: IOPS=4204, BW=16.4MiB/s (17.2MB/s)(8192MiB/498746msec)
    clat (usec): min=159, max=136331, avg=234.43, stdev=729.84
     lat (usec): min=159, max=136332, avg=234.75, stdev=729.85
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  169], 10.00th=[  172], 20.00th=[  172],
     | 30.00th=[  174], 40.00th=[  178], 50.00th=[  190], 60.00th=[  192],
     | 70.00th=[  196], 80.00th=[  206], 90.00th=[  255], 95.00th=[  338],
     | 99.00th=[ 1287], 99.50th=[ 2671], 99.90th=[ 4490], 99.95th=[ 5538],
     | 99.99th=[10945]
   bw (  KiB/s): min= 5160, max=22845, per=100.00%, avg=16836.23, stdev=4628.90, samples=997
   iops        : min= 1290, max= 5711, avg=4208.83, stdev=1157.16, samples=997
  lat (usec)   : 250=89.55%, 500=8.39%, 750=0.66%, 1000=0.26%
  lat (msec)   : 2=0.40%, 4=0.59%, 10=0.14%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.92%, sys=53.44%, ctx=2098149, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=16.4MiB/s (17.2MB/s), 16.4MiB/s-16.4MiB/s (17.2MB/s-17.2MB/s), io=8192MiB (8590MB), run=498746-498746msec

Disk stats (read/write):
  sda: ios=9049/2107796, merge=6057/27034, ticks=3548/424673, in_queue=22144, util=98.91%
randWrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

randWrite: (groupid=0, jobs=1): err= 0: pid=1343: Thu May 22 16:23:06 2025
  write: IOPS=4389, BW=17.1MiB/s (17.0MB/s)(8192MiB/477802msec)
    clat (usec): min=162, max=152676, avg=224.43, stdev=713.85
     lat (usec): min=163, max=152677, avg=224.74, stdev=713.86
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  169], 10.00th=[  172], 20.00th=[  172],
     | 30.00th=[  174], 40.00th=[  176], 50.00th=[  186], 60.00th=[  192],
     | 70.00th=[  192], 80.00th=[  200], 90.00th=[  241], 95.00th=[  322],
     | 99.00th=[  791], 99.50th=[ 2278], 99.90th=[ 4146], 99.95th=[ 5211],
     | 99.99th=[10945]
   bw (  KiB/s): min= 2244, max=21995, per=100.00%, avg=17573.48, stdev=4407.94, samples=955
   iops        : min=  561, max= 5498, avg=4393.10, stdev=1101.93, samples=955
  lat (usec)   : 250=91.02%, 500=7.29%, 750=0.63%, 1000=0.19%
  lat (msec)   : 2=0.31%, 4=0.44%, 10=0.10%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.04%, sys=55.23%, ctx=2098722, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=17.1MiB/s (17.0MB/s), 17.1MiB/s-17.1MiB/s (17.0MB/s-17.0MB/s), io=8192MiB (8590MB), run=477802-477802msec

Disk stats (read/write):
  sda: ios=9007/2105985, merge=6053/24410, ticks=3278/418892, in_queue=21432, util=99.15%